// variables

const btn = document.getElementById('new-quote');
const quote = document.querySelector(".quote");
const person = document.querySelector(".person");

let quotes = [
  {
    quote: `"ტრადიცია, რომელიც ქრისტეს მოწყდება, კერპად იქცევა და კერპს აქვს თვისება, მსხვრეპლი შეიწიროს."`,
    person: `მამა თეოდორე გიგნაძე`
  },

  {
    quote: `"ამ ქვეყანაზე ტყუილად არავინ არაფერს იძლევა, მაგრამ ძლიერია არა ის, ვინც იძლევა, არამედ ის, ვინც არ იღებს."`,
    person: `ოთარ ჭილაძე`
  },

  {
    quote: `"ადამიანი ორ ნაწილადაა გაყოფილი, ერთი ტახტზე ზის და მეორე ტახტს დაეძებს..."`,
    person: `ოთარ ჭილაძე`
  },

  {
    quote: `"სიყრმიდანვეა ადამიანის გულისწადილი მიდრეკილი ბოროტებისაკენ."`,
    person: `დაბადება 8:21 - ბიბლია`
  },

  {
    quote: `"ზოგჯერ ღირსება იმ კელდის მიღმა იმალება, სადაც მას ვეძებთ."`,
    person: `ვირჯინია ვულფი`
  },
  {
    quote: `"ხელოვნება ავსტრიაში უმეტესობისთვის ნიშნავს ნებისმიერი სახელმწიფოს წინაშე მორჩილებას და მის სამუდამო კმაყოფაზე ცხოვრებას."`,
    person: `თომას ბერნჰარდი`
  },

  {
    quote: `"ხელოვნების დიდი ნაწარმოებების მსგავსად, ღრმა გრძნობებიც ანგარიშმიუცემლად ყოველთვის იმაზე მეტს ნიშნავს, ვიდრე გამოხატავს."`,
    person: `ალბერ კამიუ`
  },
  {
    quote: `"ადამიანი ისეთივე წარმატებით შეიცნობა თავისი გათამაშებული კომედიებით, როგორც თავისი წრფელი სწრაფვით."`,
    person: `ალბერ კამიუ`
  },
  {
    quote: `"მარცხში მორწმუნე, თავის ტრიუმფს პოულობს"`,
    person: `კიერკეგორი`
  },
  {
    quote: `"წინასწარ მომზადებული საქციელი არასოდეს ბუნებრივი არაა."`,
    person: `ჯემალ ქარჩხაძე`
  },
  {
    quote: `"დილით ფიცის დადება ადვილია, რადგან საღამო ჯერ არ დამდგარა."`,
    person: `ჯემალ ქარჩხაძე`
  },
  {
    quote: `"ნამდვილ ჯამბაზს თვალებში ყინული და წებო კი არა, ნაღვლიანი საიდუმლო უნდა ჰქონდეს."`,
    person: `გურამ დოჩანაშვილი`
  },
  {
    quote: `"ჩვენ ყველას გვაქვს ჩვენი ქალაქი, მაგრამ ხანდახან არ ვიცით ხოლმე."`,
    person: `გურამ დოჩანაშვილი`
  },
  {
    quote: `"მაგრამ, იცოდეთ, – უპატრონო საფლავები არ არსებობენ, რადგანაც მიწა ყველასია."`,
    person: `გურამ დოჩანაშვილი`
  },
];


btn.addEventListener('click', function() {
    let random = Math.floor(Math.random() * quotes.length);

    quote.innerText = quotes[random].quote;
    person.innerText = quotes[random].person;
})